; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	spectrograph1 - mode
	spectrograph0 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star4 - direction
	Star3 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 115)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star3)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 183)
	(supports instrument6 spectrograph1)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 infrared2)
	(supports instrument7 spectrograph0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon7)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 103)
	(= (data Star5 spectrograph1) 140)
	(= (data Planet6 spectrograph1) 163)
	(= (data Phenomenon7 spectrograph1) 59)
	(= (data Star8 spectrograph1) 243)
	(= (data Planet9 spectrograph1) 70)
	(= (data Star10 spectrograph1) 153)
	(= (data Planet11 spectrograph1) 35)
	(= (data Star12 spectrograph1) 136)
	(= (data Star5 spectrograph0) 139)
	(= (data Planet6 spectrograph0) 92)
	(= (data Phenomenon7 spectrograph0) 277)
	(= (data Star8 spectrograph0) 287)
	(= (data Planet9 spectrograph0) 217)
	(= (data Star10 spectrograph0) 143)
	(= (data Planet11 spectrograph0) 200)
	(= (data Star12 spectrograph0) 250)
	(= (data Star5 infrared2) 232)
	(= (data Planet6 infrared2) 76)
	(= (data Phenomenon7 infrared2) 251)
	(= (data Star8 infrared2) 227)
	(= (data Planet9 infrared2) 200)
	(= (data Star10 infrared2) 197)
	(= (data Planet11 infrared2) 281)
	(= (data Star12 infrared2) 153)
	(= (slew_time Star4 GroundStation0) 65.26)
	(= (slew_time GroundStation0 Star4) 65.26)
	(= (slew_time Star4 GroundStation1) 23.09)
	(= (slew_time GroundStation1 Star4) 23.09)
	(= (slew_time Star4 GroundStation2) 12.36)
	(= (slew_time GroundStation2 Star4) 12.36)
	(= (slew_time Star4 Star3) 4.362)
	(= (slew_time Star3 Star4) 4.362)
	(= (slew_time Star3 GroundStation0) 30.72)
	(= (slew_time GroundStation0 Star3) 30.72)
	(= (slew_time Star3 GroundStation1) 58.77)
	(= (slew_time GroundStation1 Star3) 58.77)
	(= (slew_time Star3 GroundStation2) 1.427)
	(= (slew_time GroundStation2 Star3) 1.427)
	(= (slew_time GroundStation2 GroundStation0) 44.75)
	(= (slew_time GroundStation0 GroundStation2) 44.75)
	(= (slew_time GroundStation2 GroundStation1) 34.35)
	(= (slew_time GroundStation1 GroundStation2) 34.35)
	(= (slew_time GroundStation1 GroundStation0) 9.375)
	(= (slew_time GroundStation0 GroundStation1) 9.375)
	(= (slew_time Star5 GroundStation0) 62.11)
	(= (slew_time GroundStation0 Star5) 62.11)
	(= (slew_time Star5 GroundStation1) 46.84)
	(= (slew_time GroundStation1 Star5) 46.84)
	(= (slew_time Star5 GroundStation2) 5.274)
	(= (slew_time GroundStation2 Star5) 5.274)
	(= (slew_time Star5 Star3) 46.41)
	(= (slew_time Star3 Star5) 46.41)
	(= (slew_time Star5 Star4) 31.47)
	(= (slew_time Star4 Star5) 31.47)
	(= (slew_time Planet6 GroundStation0) 40.89)
	(= (slew_time GroundStation0 Planet6) 40.89)
	(= (slew_time Planet6 GroundStation1) 11.34)
	(= (slew_time GroundStation1 Planet6) 11.34)
	(= (slew_time Planet6 GroundStation2) 15.24)
	(= (slew_time GroundStation2 Planet6) 15.24)
	(= (slew_time Planet6 Star3) 22.63)
	(= (slew_time Star3 Planet6) 22.63)
	(= (slew_time Planet6 Star4) 46.28)
	(= (slew_time Star4 Planet6) 46.28)
	(= (slew_time Planet6 Star5) 35.79)
	(= (slew_time Star5 Planet6) 35.79)
	(= (slew_time Phenomenon7 GroundStation0) 70.64)
	(= (slew_time GroundStation0 Phenomenon7) 70.64)
	(= (slew_time Phenomenon7 GroundStation1) 54.25)
	(= (slew_time GroundStation1 Phenomenon7) 54.25)
	(= (slew_time Phenomenon7 GroundStation2) 13.49)
	(= (slew_time GroundStation2 Phenomenon7) 13.49)
	(= (slew_time Phenomenon7 Star3) 17.28)
	(= (slew_time Star3 Phenomenon7) 17.28)
	(= (slew_time Phenomenon7 Star4) 11.5)
	(= (slew_time Star4 Phenomenon7) 11.5)
	(= (slew_time Phenomenon7 Star5) 5.716)
	(= (slew_time Star5 Phenomenon7) 5.716)
	(= (slew_time Phenomenon7 Planet6) 57.84)
	(= (slew_time Planet6 Phenomenon7) 57.84)
	(= (slew_time Star8 GroundStation0) 62.29)
	(= (slew_time GroundStation0 Star8) 62.29)
	(= (slew_time Star8 GroundStation1) 9.15)
	(= (slew_time GroundStation1 Star8) 9.15)
	(= (slew_time Star8 GroundStation2) 4.955)
	(= (slew_time GroundStation2 Star8) 4.955)
	(= (slew_time Star8 Star3) 76.88)
	(= (slew_time Star3 Star8) 76.88)
	(= (slew_time Star8 Star4) 26.43)
	(= (slew_time Star4 Star8) 26.43)
	(= (slew_time Star8 Star5) 42.05)
	(= (slew_time Star5 Star8) 42.05)
	(= (slew_time Star8 Planet6) 27.52)
	(= (slew_time Planet6 Star8) 27.52)
	(= (slew_time Star8 Phenomenon7) 4.723)
	(= (slew_time Phenomenon7 Star8) 4.723)
	(= (slew_time Planet9 GroundStation0) 41.96)
	(= (slew_time GroundStation0 Planet9) 41.96)
	(= (slew_time Planet9 GroundStation1) 31.4)
	(= (slew_time GroundStation1 Planet9) 31.4)
	(= (slew_time Planet9 GroundStation2) 47)
	(= (slew_time GroundStation2 Planet9) 47)
	(= (slew_time Planet9 Star3) 22.3)
	(= (slew_time Star3 Planet9) 22.3)
	(= (slew_time Planet9 Star4) 20.98)
	(= (slew_time Star4 Planet9) 20.98)
	(= (slew_time Planet9 Star5) 20.66)
	(= (slew_time Star5 Planet9) 20.66)
	(= (slew_time Planet9 Planet6) 10.82)
	(= (slew_time Planet6 Planet9) 10.82)
	(= (slew_time Planet9 Phenomenon7) 11.81)
	(= (slew_time Phenomenon7 Planet9) 11.81)
	(= (slew_time Planet9 Star8) 44.76)
	(= (slew_time Star8 Planet9) 44.76)
	(= (slew_time Star10 GroundStation0) 69.12)
	(= (slew_time GroundStation0 Star10) 69.12)
	(= (slew_time Star10 GroundStation1) 2.215)
	(= (slew_time GroundStation1 Star10) 2.215)
	(= (slew_time Star10 GroundStation2) 42.84)
	(= (slew_time GroundStation2 Star10) 42.84)
	(= (slew_time Star10 Star3) 41.76)
	(= (slew_time Star3 Star10) 41.76)
	(= (slew_time Star10 Star4) 39.66)
	(= (slew_time Star4 Star10) 39.66)
	(= (slew_time Star10 Star5) 36.62)
	(= (slew_time Star5 Star10) 36.62)
	(= (slew_time Star10 Planet6) 50.31)
	(= (slew_time Planet6 Star10) 50.31)
	(= (slew_time Star10 Phenomenon7) 59.98)
	(= (slew_time Phenomenon7 Star10) 59.98)
	(= (slew_time Star10 Star8) 31.22)
	(= (slew_time Star8 Star10) 31.22)
	(= (slew_time Star10 Planet9) 66.37)
	(= (slew_time Planet9 Star10) 66.37)
	(= (slew_time Planet11 GroundStation0) 19.28)
	(= (slew_time GroundStation0 Planet11) 19.28)
	(= (slew_time Planet11 GroundStation1) 18.6)
	(= (slew_time GroundStation1 Planet11) 18.6)
	(= (slew_time Planet11 GroundStation2) 3.338)
	(= (slew_time GroundStation2 Planet11) 3.338)
	(= (slew_time Planet11 Star3) 39.15)
	(= (slew_time Star3 Planet11) 39.15)
	(= (slew_time Planet11 Star4) 99.11)
	(= (slew_time Star4 Planet11) 99.11)
	(= (slew_time Planet11 Star5) 28.82)
	(= (slew_time Star5 Planet11) 28.82)
	(= (slew_time Planet11 Planet6) 28.43)
	(= (slew_time Planet6 Planet11) 28.43)
	(= (slew_time Planet11 Phenomenon7) 19.34)
	(= (slew_time Phenomenon7 Planet11) 19.34)
	(= (slew_time Planet11 Star8) 7.134)
	(= (slew_time Star8 Planet11) 7.134)
	(= (slew_time Planet11 Planet9) 12.51)
	(= (slew_time Planet9 Planet11) 12.51)
	(= (slew_time Planet11 Star10) 63.76)
	(= (slew_time Star10 Planet11) 63.76)
	(= (slew_time Star12 GroundStation0) 59.36)
	(= (slew_time GroundStation0 Star12) 59.36)
	(= (slew_time Star12 GroundStation1) 57.01)
	(= (slew_time GroundStation1 Star12) 57.01)
	(= (slew_time Star12 GroundStation2) 1.87)
	(= (slew_time GroundStation2 Star12) 1.87)
	(= (slew_time Star12 Star3) 21.81)
	(= (slew_time Star3 Star12) 21.81)
	(= (slew_time Star12 Star4) 19.08)
	(= (slew_time Star4 Star12) 19.08)
	(= (slew_time Star12 Star5) 53.52)
	(= (slew_time Star5 Star12) 53.52)
	(= (slew_time Star12 Planet6) 5.931)
	(= (slew_time Planet6 Star12) 5.931)
	(= (slew_time Star12 Phenomenon7) 15.61)
	(= (slew_time Phenomenon7 Star12) 15.61)
	(= (slew_time Star12 Star8) 44.42)
	(= (slew_time Star8 Star12) 44.42)
	(= (slew_time Star12 Planet9) 41.97)
	(= (slew_time Planet9 Star12) 41.97)
	(= (slew_time Star12 Star10) 49.43)
	(= (slew_time Star10 Star12) 49.43)
	(= (slew_time Star12 Planet11) 40.71)
	(= (slew_time Planet11 Star12) 40.71)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star5 spectrograph1)
	(have_image Planet6 spectrograph1)
	(have_image Phenomenon7 spectrograph0)
	(have_image Star8 infrared2)
	(have_image Star10 spectrograph1)
	(have_image Planet11 spectrograph0)
	(have_image Star12 spectrograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 star5 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star5)
   changed: (fuel satellite2) from 103 to 97.284, (fuel-used) from 0 to 5.716
   goals met: 0 of 7
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 7
3. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 7
4. (turn_to satellite2 groundstation2 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 97.284 to 92.01, (fuel-used) from 5.716 to 10.99
   goals met: 0 of 7
5. (calibrate satellite2 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 0 of 7
6. (turn_to satellite2 star5 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star5)
   changed: (fuel satellite2) from 92.01 to 86.736, (fuel-used) from 10.99 to 16.264
   goals met: 0 of 7
7. (take_image satellite2 star5 instrument6 spectrograph1)
   added: (have_image star5 spectrograph1)
   changed: (data_capacity satellite2) from 1000 to 860, (data-stored) from 0 to 140
   goals met: 1 of 7
8. (turn_to satellite2 star12 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star12)
   changed: (fuel satellite2) from 86.736 to 33.216, (fuel-used) from 16.264 to 69.784
   goals met: 1 of 7
9. (turn_to satellite1 groundstation1 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 183 to 180.785, (fuel-used) from 69.784 to 71.999
   goals met: 1 of 7
10. (turn_to satellite2 planet6 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 33.216 to 27.285, (fuel-used) from 71.999 to 77.93
   goals met: 1 of 7
11. (take_image satellite2 planet6 instrument6 spectrograph1)
   added: (have_image planet6 spectrograph1)
   changed: (data_capacity satellite2) from 860 to 697, (data-stored) from 140 to 303
   goals met: 2 of 7
12. (turn_to satellite2 star12 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star12)
   changed: (fuel satellite2) from 27.285 to 21.354, (fuel-used) from 77.93 to 83.861
   goals met: 2 of 7
13. (take_image satellite2 star12 instrument6 spectrograph1)
   added: (have_image star12 spectrograph1)
   changed: (data_capacity satellite2) from 697 to 561, (data-stored) from 303 to 439
   goals met: 3 of 7
14. (turn_to satellite2 groundstation2 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 21.354 to 19.484, (fuel-used) from 83.861 to 85.731
   goals met: 3 of 7
15. (turn_to satellite2 planet11 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet11)
   changed: (fuel satellite2) from 19.484 to 16.146, (fuel-used) from 85.731 to 89.069
   goals met: 3 of 7
16. (take_image satellite2 planet11 instrument6 spectrograph0)
   added: (have_image planet11 spectrograph0)
   changed: (data_capacity satellite2) from 561 to 361, (data-stored) from 439 to 639
   goals met: 4 of 7
17. (turn_to satellite2 star8 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 16.146 to 9.012, (fuel-used) from 89.069 to 96.203
   goals met: 4 of 7
18. (turn_to satellite2 phenomenon7 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 9.012 to 4.289, (fuel-used) from 96.203 to 100.926
   goals met: 4 of 7
19. (take_image satellite2 phenomenon7 instrument6 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   changed: (data_capacity satellite2) from 361 to 84, (data-stored) from 639 to 916
   goals met: 5 of 7
20. (turn_to satellite1 star10 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star10)
   changed: (fuel satellite1) from 180.785 to 178.57, (fuel-used) from 100.926 to 103.141
   goals met: 5 of 7
21. (turn_to satellite1 groundstation1 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 178.57 to 176.355, (fuel-used) from 103.141 to 105.356
   goals met: 5 of 7
22. (turn_to satellite1 star10 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star10)
   changed: (fuel satellite1) from 176.355 to 174.14, (fuel-used) from 105.356 to 107.571
   goals met: 5 of 7
23. (turn_to satellite1 groundstation1 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 174.14 to 171.925, (fuel-used) from 107.571 to 109.786
   goals met: 5 of 7
24. (calibrate satellite1 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 5 of 7
25. (turn_to satellite1 star10 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star10)
   changed: (fuel satellite1) from 171.925 to 169.71, (fuel-used) from 109.786 to 112.001
   goals met: 5 of 7
26. (take_image satellite1 star10 instrument4 spectrograph1)
   added: (have_image star10 spectrograph1)
   changed: (data_capacity satellite1) from 1000 to 847, (data-stored) from 916 to 1069
   goals met: 6 of 7
27. (turn_to satellite1 star8 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star8)
   changed: (fuel satellite1) from 169.71 to 138.49, (fuel-used) from 112.001 to 143.221
   goals met: 6 of 7
28. (take_image satellite1 star8 instrument4 infrared2)
   added: (have_image star8 infrared2)
   changed: (data_capacity satellite1) from 847 to 620, (data-stored) from 1069 to 1296
   goals met: 7 of 7
